app/controllers/chats_controller.rb

SELECT  "chats".* FROM "chats" WHERE "chats"."id" IS NULL AND "chats"."room_id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" = ?  [["user_id", 2], ["room_id", 3]]
INSERT INTO "chats" ("user_id", "room_id", "chat", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["room_id", 3], ["chat", "ad"], ["created_at", "2020-08-10 03:57:34.851578"], ["updated_at", "2020-08-10 03:57:34.851578"]]
---
  def create

    if UserRoom.where(user_id: current_user.id, room_id: params[:chat][:room_id]).present?
      @chat = Chat.create(params.require(:chat).permit(:user_id, :chat, :room_id).merge(user_id: current_user.id))

SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 16]]
---
  def destroy
    # @chats = @room.chats
    @chat = Chat.find(params[:id])
    @chat.destroy