app/controllers/rooms_controller.rb

  def create
    @room = Room.create
    @user_room1 = UserRoom.create(room_id: @room.id, user_id: current_user.id)
    # 現在ログインしているユーザーに対しては、@entry1とし、
    # EntriesテーブルにRoom.createで作成された@roomにひもづくidと、
    # 現在ログインしているユーザーのidを保存させる記述をします。
    @user_room2 = UserRoom.create(params.require(:user_room).permit(:user_id, :room_id).merge(room_id: @room.id))
---
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-08-09 09:08:01.989385"], ["updated_at", "2020-08-09 09:08:01.989385"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 1], ["created_at", "2020-08-09 09:08:02.091939"], ["updated_at", "2020-08-09 09:08:02.091939"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["room_id", 2], ["created_at", "2020-08-09 09:09:04.073024"], ["updated_at", "2020-08-09 09:09:04.073024"]]

  def show
    @room = Room.find(params[:id])
    if UserRoom.where(user_id: current_user.id, room_id: @room.id).present?
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" = ?  [["user_id", 2], ["room_id", 2]]