app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @books = @user.books
    @book = Book.new
    # チャット機能の定義します
      if user_signed_in?
        @currentUserEntry = UserRoom.where(user_id: current_user.id)
        @userEntry = UserRoom.where(user_id: @user.id)
        unless @user.id == current_user.id
          @currentUserEntry.each do |cu|
            @userEntry.each do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 5]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 5]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 2]]